[
    {
        "title": "Python for Beginners",
        "description": "Join this free online course to learn how to program with Python. You’ll be introduced to the fundamentals of the programming language like variables, data types, and loops. More complex topics like functions, libraries, and file input and output will also be covered. At the end of the course, you’ll be able to write simple Python programs to be prepared for your next programming challenges."
    },
    {
        "title": "Introduction to Enterprise Applications",
        "description": "In this course, you’ll get an overview of the key ingredients of enterprise applications - in general as well as on the example of SAP's offerings. The course covers an introduction to SAP and its history, business processes, as well as different modules of ERP Systems (e.g., Financials, Supply Chain Management, and Customer Relationship Management). The content is rounded up by an outlook into enterprise cloud platforms.\nYou don’t require much prior knowledge to attend the course and you’ll experience it like a student in the lecture hall. All sessions were recorded during the in-person lecture at the HPI in 2022. This course is a good foundation for to the (also free) courses Enterprise Goes Cloud 1 and  Enterprise Goes Cloud 2.\nThis course is aimed at providing basic knowledge. There is no final examination. In this course, participants can only obtain a certificate of attendance. There is no discussion forum."
    },
    {
        "title": "Lehrkräfteprofessionalisierung für KI in Schule und Unterricht",
        "description": "Künstliche Intelligenz ist längst Teil des gesellschaftlichen und schulischen Alltags und eröffnet neue Möglichkeiten für das Lehren und Lernen. Besonders im sprachlichen Unterricht können KI-Systeme individuelle Lernprozesse unterstützen, etwa durch automatisiertes Feedback zu Texten oder das individualisierte Lernen mit Intelligenten Tutoriellen Systemen. Gleichzeitig bringt der Einsatz von KI-basierten Systemen im schulischen Kontext ethische, rechtliche und soziale Herausforderungen mit sich. Der Kurs thematisiert all dies und unterstützt Lehrkräfte dabei, die Chancen KI-basierter Systeme zu nutzen und Risiken reflektiert sowie konstruktiv zu begegnen."
    },
    {
        "title": "Chatbots leicht gemacht: Große Sprachmodelle einfach nutzen",
        "description": "Die wachsende Bedeutung von KI-Chatbots in der modernen Arbeitswelt stellt Organisationen vor neue Herausforderungen und Chancen. Wie können intelligente Assistenten dabei helfen, große Dokumentensammlungen zu analysieren oder Daten für Berichte aufzubereiten? Welche Möglichkeiten entstehen, wenn Chatbots direkt mit den Programmen arbeiten, die wir täglich nutzen? Und wie lassen sich diese Technologien praktisch und sicher in bestehende Arbeitsabläufe integrieren?  \nEntdecken Sie in diesem zweiwöchigen, praxisorientierten Kurs, wie Sie Ihren eigenen funktionsfähigen Chatbot erstellen und mit Ihren Dokumenten und Anwendungen verbinden können. Der Kurs richtet sich an Fachkräfte ohne tiefe Programmierungskenntnisse und folgt dem Prinzip „wenig Theorie, viel Praxis“. Sie lernen, wie moderne KI-Tools wie OpenWebUI, OpenRouter und Docker zusammenarbeiten, um leistungsstarke KI-Assistenten zu schaffen."
    },
    {
        "title": "Efficient AI for Weather Forecasting",
        "description": "Extreme weather events have caused severe damage and loss of life in recent decades. Traditional numerical weather prediction, while accurate, is computationally intensive—requiring supercomputers that consume massive amounts of energy. In contrast, energy-efficient AI offers a transformative alternative. This course explores how modern AI models can drastically reduce energy consumption and CO₂ emissions while improving the accuracy and accessibility of weather forecasting. Through practical examples, we demonstrate how techniques like LoRA fine-tuning, diffusion models, and GNSS-based sensing can enhance forecasting capabilities on both large and personal devices. By the end of this course, learners will understand how efficient AI methods enable sustainable, high-precision weather prediction for the future."
    },
    {
        "title": "Argumentieren lernen mit KI - für Schule & Alltag",
        "description": "Du bist überzeugt, aber noch nicht überzeugend?\nIn diesem Kurs lernst du, wie du deine Meinung klar und verständlich rüberbringen kannst. Schritt für Schritt entwickelst du die Fähigkeit, ein Thema zu verstehen, dir eine eigene Meinung zu bilden und mit anderen zu diskutieren. Dabei unterstützt dich ein KI-gestütztes Lerntool, das dich als Coach, Feedbackgeber und Gesprächspartner begleitet.\n\n\n\nWichtige Infos\n\nZusätzlich zu den Kursmaterialien auf openHPI kannst du in diesem Kurs Schreibübungen machen und bekommst dazu Feedback von einer KI. Das Ganze läuft direkt im Browser – du musst also nichts installieren und dich auch nicht registrieren. (Denk Link findest du in dem Kurs.) Beim ersten Start bekommst du automatisch einen 10-stelligen Code (z. B. abc123defg). Den solltest du dir unbedingt aufschreiben, weil du ohne ihn später nicht mehr an deine Texte kommst.\nWichtig: Nach 30 Tagen werden alle deine Texte automatisch gelöscht. Wenn du sie behalten möchtest, speichere sie also vorher ab. Chats und Feedback liefert eine KI auf Basis der OpenAI-Technologie."
    },
    {
        "title": "Time Series Analysis",
        "description": "In this course, you’ll learn how to work with time series data — one of the most common and challenging types of data across industries. We’ll start from the basics, introducing you to key concepts like trends, seasonality, and stationarity, and gradually move into more advanced forecasting techniques. You’ll explore both classical statistical models and modern machine learning approaches, and see how deep learning architectures like RNNs, LSTMs, and transformers are being used for cutting-edge forecasting tasks today. Along the way, we’ll cover real-world examples from finance, healthcare, weather forecasting, and beyond. By the end of the course, you’ll have the skills to analyze time series data, build reliable forecasting models, and apply them to practical problems."
    },
    {
        "title": "Summer Coding Ferienkurse",
        "description": "🎓 Code your Future – Deine Skills. Deine Ferien. Deine Zukunft.🚀\n\nLust auf was richtig Nützliches in den Ferien? In unseren Summer Coding Kursen 2025 lernst du nicht nur programmieren sondern du baust Skills auf, die dich weiterbringen. Egal ob du Games feierst, Apps cool findest oder einfach mal wissen willst, wie Computer eigentlich „denken“ – bei uns bist du richtig. \nPython – einfach zu lernen, super vielseitig, ideal für Einsteiger:innen. Von Mini-Games bis hin zu Webentwicklung oder KI, mit Python kannst du sofort loslegen.\nJava – die Sprache hinter vielen Games, Android-Apps und Unternehmenssoftware. Wenn du tiefer eintauchen willst, ist Java genau dein Ding.\nSuche dir einen Kurs aus oder mache beide! \nWas bringt es dir?  \n\n\nDu lernst echte Coding-Skills, die du sofort anwenden kannst. \nDu trainierst dein logisches Denken ganz nebenbei. \nDu stärkst deine digitale Selbstbestimmung: Versteh die Technik, statt von ihr gesteuert zu werden. \nDu bekommst einen Leistungsnachweis, den du z. B. für Bewerbungen nutzen kannst. \n\n\n\n\nDie Ferienkurse richten sich an Schüler*innen ab der 8. bzw 10. Klasse und dauern jeweils ca. 4 Wochen. Du brauchst keine Vorkenntnisse. Es gibt die Möglichkeit, einen Leistungsnachweis zu erhalten. Die Kurse sind kostenlos. Wir freuen uns auf deine Teilnahme und dein Feedback!"
    },
    {
        "title": "Sustainability in the digital age: AI and Sustainability - Balancing Innovation and Responsibility",
        "description": "Welcome to the \"Sustainability in the Digital Age\" series\n\nThis course explores the critical  intersection of AI and sustainability, highlighting how technological advancement can align with environmental responsibility. It offers insights into the dual nature of AI, noting its potential for increasing efficiency and driving sustainable innovation, while also acknowledging the significant energy consumption involved in training and applying AI models. In this course, we are not only examining the paradox of AI and sustainability but also provides actionable recommendations for incorporating sustainability into AI application development. By examining AI's transformative role and its environmental impact, the course offers a comprehensive understanding of how AI can be harnessed to support global sustainability goals effectively.\nThis course is part of the Sustainability in the Digital Age series, a collaborative project between colleagues from Stanford University, SAP and the Hasso Plattner Institute."
    },
    {
        "title": "Sustainability in the Digital Age: Efficient AI Techniques in the LLM Era",
        "description": "Welcome to the \"Sustainability in the Digital Age\" series\n\nIn an era where digital technologies are reshaping industries and daily life, the environmental impact of AI systems has become a growing concern. This course explores efficient AI methodologies to address these challenges. From deep learning model compression to low-bit quantization and collaborative inference, we delve into techniques that enhance computational efficiency and reduce energy consumption. We will also focus on low-bit quantization specifically for large language models (LLMs), showcasing cutting-edge open-source tools and models. Join us to learn how to build sustainable AI systems while pushing the boundaries of innovation.\nThis course is part of the Sustainability in the Digital Age series, a collaborative project between colleagues from Stanford University, SAP and the Hasso Plattner Institute."
    },
    {
        "title": "Practical Computer Vision with PyTorch",
        "description": "Practical Computer Vision in PyTorch is a comprehensive, hands-on course for developers and practitioners eager to explore computer vision with PyTorch. It spans image classification, object detection, segmentation, and generative modeling. Emphasizing implementation, participants work through coding demos and projects with industry-standard tools and libraries. By the end, they will be able to build and fine-tune computer-vision models for real-world applications."
    },
    {
        "title": "Potsdam Cyber Games",
        "description": "Durch ein geheimes Auswahlverfahren wurde Euer Team auserwählt, in die dunklen Gassen von Berlin und Potsdam einzutauchen - zur Infiltration des Verstecks einer berüchtigten Hacker-Organisation. Eure Mission: Unmask the Underground! :male-detective: Schon beim ersten Schritt wird Euch klar: Hinter der Fassade verbirgt sich eine große kriminelle Infrastruktur, die es zu durchbrechen gilt.\nFür mehr Informationen schau doch mal auf unserer Website vorbei. \nWillkommen zu den 3. Potsdam Cyber Games. Mögen die Spiele beginnen."
    },
    {
        "title": "Sustainability in the digital age: Energy-Efficient Software Development",
        "description": "Welcome to the \"Sustainability in the Digital Age\" series\n\nDigital systems offer a great opportunity to significantly reduce carbon emissions and can contribute to the efficient use of energy. However, all systems also need energy. This area of tension is addressed in the course: Sustainability in the digital age - Energy-Efficient Software Development. To effectively reduce the carbon footprint of digitalization, it is necessary to apply algorithmic efficiency and sustainability by design as guiding principles in digital engineering. We will introduce strategies to develop software that prioritizes minimized energy consumption through optimal coding and green testing practices. We will look at how the CO2 emissions of operating software applications can be measured and calculated. How to measure the performance and energy consumption of Large Language Models will be covered as well. Further we share approaches how to use advances in hardware technology and operate digital systems efficiently in data centers based on eco-friendly and cost-effective capacity management strategies.\nThis course is part of the Sustainability in the Digital Age series, a collaborative project between colleagues from Stanford University, SAP and the Hasso Plattner Institute."
    },
    {
        "title": "Sustainability in the digital age: Environmental Impacts of AI Systems",
        "description": "Welcome to the \"Sustainability in the Digital Age\" series\n\nArtificial Intelligence (AI) offers transformative potential across industries, but its development and deployment come with environmental costs. The course covers topics such as the carbon footprint of AI models, methods for measuring and reporting environmental impacts, and challenges in estimating the sustainability of AI technologies. Students will gain insights into energy and carbon accounting, along with case studies demonstrating how AI’s environmental footprint is assessed. The course aims to provide a comprehensive understanding of the relationship between AI and the environment, equipping learners with knowledge to contribute to more sustainable AI practices.\nThis course is part of the Sustainability in the Digital Age series, a collaborative project between colleagues from Stanford University, SAP and the Hasso Plattner Institute."
    },
    {
        "title": "KI-Biases verstehen und vermeiden",
        "description": "Künstliche Intelligenz durchdringt zunehmend unseren (Arbeits)Alltag. Vor allem generative KI-Systeme haben die Masse der Arbeitnehmerschaft erreicht. Doch diese KI-Systeme sind nicht frei von Vorurteilen und Verzerrungen – sogenannten Biases – denn sie sind durch Menschen erzeugt. Diese Biases können zu diskriminierenden Ergebnissen führen. Das Erkennen, Verstehen und Bereinigen von Biases ist deshalb von entscheidender Bedeutung, um eine gerechte und ethische Nutzung zu gewährleisten und potenzielle Schäden von Teilnehmenden und Unternehmen abzuwählen."
    },
    {
        "title": "Workshop: Python-Minigames in Replit",
        "description": "Willkommen zu unserem neuen Workshop-Format auf openHPI\nMöchtest du eine der weltweit beliebtesten Programmiersprachen schnell und praxisnah lernen? Dann ist dieser Python-Workshop perfekt für dich! \nIn kurzen, verständlichen Videos vermitteln wir dir die Grundkonzepte der Programmiersprache Python – und das auf eine spannende Weise: Lerne Python, indem du ein Spiel programmierst. Am Ende bist du in der Lage, ein eigenes Spiel zu entwickeln und dieses mit eigenen Ideen zu gestalten. \nMach mit und erlebe, wie viel Spaß Programmieren machen kann! \nDer Workshop richtet sich an Schüler*innen ab der 8. Klasse und dauert ca. 2-3 Stunden. Es gibt die Möglichkeit, einen Teilnahmenachweis zu erhalten. Wir freuen uns auf euer Feedback zu diesem neuen Format! \nWeitere Angebote für Schüler*innen findet ihr hier: www.hpi.de/schueler. Die nächsten Bewerbungsphasen für die Formate starten Anfang Februar 2025."
    },
    {
        "title": "Profitable AI",
        "description": "This course explores the hype and realities surrounding AI, the challenges companies face in using AI profitably, and how Germany is performing in the AI landscape. It offers insights into how AI can power business strategies, be successfully integrated into operations, and scaled for long-term profitable growth. Created for managers and data experts looking to maximize AI’s potential, the course requires no prior experience, though a basic understanding of business strategy, data analytics, and AI concepts is beneficial."
    }
]